Repository: BhawarthPadwal/uber-clone
Catalog: flutter_uber_clone_app/lib/l10n/app_*.arb
Languages: kn, mr, ru, zh

# appName
source: RideSeva
kn: ರೈಡ್ ಸೇವಾ
mr: राईडसेवा
ru: РайдСева

# welcome
source: Welcome to RideSeva
kn: ರೈಡ್ ಸೇವಾಕ್ಕೆ ಸುಸ್ವಾಗತ
mr: राईडसेवा मध्ये स्वागत आहे
ru: Добро пожаловать в РайдСева
zh: 欢迎使用 RideSeva

source: Login
kn: ಲಾಗಿನ್
mr: लॉगिन
ru: Войти
zh: 登录

source: Login here
kn: ಇಲ್ಲಿ ಲಾಗಿನ್ ಮಾಡಿ
mr: येथे लॉगिन करा
ru: Войти здесь
zh: 在此登录

source: Sign Up
kn: ಸೈನ್ ಅಪ್
mr: साइन अप
ru: Зарегистрироваться
zh: 注册

source: Loading...
kn: ಲೋಡ್ ಆಗುತ್ತಿದೆ...
mr: लोड करत आहे...
ru: Загрузка...
zh: 加载中...

source: Cancel
kn: ರದ್ದುಮಾಡಿ
mr: रद्द करा
ru: Отмена
zh: 取消

source: Ignore
kn: ಅಲಕ್ಷ್ಯ ಮಾಡಿ
mr: दुर्लक्ष करा
ru: Игнорировать
zh: 忽略

# getStarted
source: Get Started with RideSeva
kn: ರೈಡ್ ಸೇವಾ ಜೊತೆ ಆರಂಭಿಸಿ
mr: राईडसेवा सोबत सुरुवात करा
ru: Начните с РайдСева
zh: 开始使用 RideSeva

# continueTxt
source: Continue
kn: ಮುಂದುವರಿಸಿ
mr: पुढे चालू ठेवा
ru: Продолжить
zh: 继续

# enterEmail
source: What's your email
kn: ನಿಮ್ಮ ಇಮೇಲ್ ಏನು?
mr: तुमचा ईमेल काय आहे?
ru: Ваш адрес электронной почты
zh: 请输入您的邮箱

# enterName
source: What's your name
kn: ನಿಮ್ಮ ಹೆಸರೇನು?
mr: तुमचं नाव काय आहे?
ru: Ваше имя
zh: 请输入您的姓名

source: Enter Password
kn: ಪಾಸ್‌ವರ್ಡ್ ನಮೂದಿಸಿ
mr: पासवर्ड प्रविष्ट करा
ru: Введите пароль
zh: 请输入密码

# enterConfirmPassword
source: Confirm Password
kn: ಪಾಸ್ವರ್ಡ್ ದೃಢೀಕರಿಸಿ
mr: पासवर्डची पुष्टी करा
ru: Подтвердите пароль
zh: 确认密码

source: Create account
kn: ಖಾತೆ ರಚಿಸಿ
mr: खाते तयार करा
ru: Создать аккаунт
zh: 创建账户

source: Create New Account
kn: ಹೊಸ ಖಾತೆ ರಚಿಸಿ
mr: नवीन खाते तयार करा
ru: Создать новый аккаунт
zh: 创建新账户

# emailHint
source: email@example.com
kn: email@gmail.com
mr: email@gmail.com
ru: email@gmail.com

# passwordHint
source: password
kn: ಪಾಸ್ವರ್ಡ್
mr: पासवर्ड
ru: пароль
zh: 密码

# emailWarning
source: Please enter your email
kn: ದಯವಿಟ್ಟು ನಿಮ್ಮ ಇಮೇಲ್ ನಮೂದಿಸಿ
mr: कृपया तुमचा ईमेल प्रविष्ट करा
ru: Пожалуйста, введите email
zh: 请输入邮箱地址

# invalidEmailWarning
source: Please enter a valid email
kn: ದಯವಿಟ್ಟು ಮಾನ್ಯವಾದ ಇಮೇಲ್ ನಮೂದಿಸಿ
mr: कृपया वैध ईमेल प्रविष्ट करा
ru: Пожалуйста, введите корректный email
zh: 请输入有效的邮箱地址

# passwordWarning
source: Please enter your password
kn: ದಯವಿಟ್ಟು ಪಾಸ್ವರ್ಡ್ ನಮೂದಿಸಿ
mr: कृपया पासवर्ड प्रविष्ट करा
ru: Пожалуйста, введите пароль
zh: 请输入密码

# confirmPasswordWarning
source: Please confirm your password
kn: ದಯವಿಟ್ಟು ಪಾಸ್ವರ್ಡ್ ದೃಢೀಕರಿಸಿ
mr: कृपया पासवर्डची पुष्टी करा
ru: Пожалуйста, подтвердите пароль
zh: 请确认密码

# passwordMatchWarning
source: Password do not match
kn: ಪಾಸ್ವರ್ಡ್ ಗಳು ಹೊಂದಿಕೆಯಾಗುತ್ತಿಲ್ಲ
mr: पासवर्ड जुळले नाहीत
ru: Пароли не совпадают
zh: 密码不匹配

# warning
source: Kindly fill all fields
kn: ದಯವಿಟ್ಟು ಎಲ್ಲಾ ಕ್ಷೇತ್ರಗಳನ್ನು ಭರ್ತಿ ಮಾಡಿ
mr: कृपया सर्व फील्ड भरा
ru: Пожалуйста, заполните все поля
zh: 请填写所有字段

# inviteTxt
source: Join a fleet?
kn: ಫ್ಲೀಟ್‌ಗೆ ಸೇರಬೇಕಾ?
mr: फ्लीटमध्ये सामील व्हायचंय?
ru: Присоединиться к автопарку?
zh: 要加入一个车队吗？

source: New here?
kn: ಹೊಸಬರಾ?
mr: इथे नवीन आहात?
ru: Вы здесь впервые?
zh: 新用户？

# captainNameLabel
source: What's our Captain's name
kn: ನಮ್ಮ ಕ್ಯಾಪ್ಟನ್ ಹೆಸರು ಏನು?
mr: आपल्या कॅप्टनचं नाव काय आहे?
ru: Имя нашего водителя
zh: 司机的名字是？

# captainEmailLabel
source: What's our Captain's email
kn: ಕ್ಯಾಪ್ಟನ್ ಇಮೇಲ್ ಏನು?
mr: कॅप्टनचा ईमेल काय आहे?
ru: Email водителя
zh: 司机的邮箱是？

# firstNameLabel
source: First Name
kn: ಮೊದಲ ಹೆಸರು
mr: पहिलं नाव
ru: Имя
zh: 名字

# lastNameLabel
source: Last Name
kn: ಕೊನೆಯ ಹೆಸರು
mr: आडनाव
ru: Фамилия
zh: 姓氏

# firstNameWarning
source: Enter your firstname
kn: ನಿಮ್ಮ ಮೊದಲ ಹೆಸರು ನಮೂದಿಸಿ
mr: तुमचं पहिलं नाव प्रविष्ट करा
ru: Введите ваше имя
zh: 请输入名字

# lastNameWarning
source: Enter your lastname
kn: ನಿಮ್ಮ ಕೊನೆಯ ಹೆಸರು ನಮೂದಿಸಿ
mr: तुमचं आडनाव प्रविष्ट करा
ru: Введите вашу фамилию
zh: 请输入姓氏

# vehicleInfoLabel
source: Vehicle Information
kn: ವಾಹನದ ಮಾಹಿತಿ
mr: वाहन माहिती
ru: Информация о транспорте
zh: 车辆信息

# vehicleColorLabel
source: Vehicle Color
kn: ವಾಹನದ ಬಣ್ಣ
mr: वाहनाचा रंग
ru: Цвет транспорта
zh: 车辆颜色

# vehiclePlateLabel
source: Vehicle Plate
kn: ವಾಹನದ ನಂಬರ್ ಪ್ಲೇಟ್
mr: वाहन क्रमांक
ru: Номерной знак
zh: 车牌号

# vehicleCapacityLabel
source: Vehicle Capacity
kn: ವಾಹನ ಸಾಮರ್ಥ್ಯ
mr: वाहन क्षमतेची माहिती
ru: Вместимость транспорта
zh: 车辆容量

# selectVehicleTypeLabel
source: Select Vehicle
kn: ವಾಹನ ಆಯ್ಕೆಮಾಡಿ
mr: वाहन निवडा
ru: Выберите тип транспорта
zh: 选择车辆类型

# carLabel
source: car
kn: ಕಾರ್
mr: कार
ru: автомобиль
zh: 汽车

# motorcycleLabel
source: motorcycle
kn: ಮೋಟಾರ್ ಸೈಕಲ್
mr: मोटरसायकल
ru: мотоцикл
zh: 摩托车

# autoLabel
source: auto
kn: ಆಟೋ
mr: ऑटो
ru: рикша
zh: 三轮车

# vehicleColorWarning
source: Enter vehicle color
kn: ವಾಹನ ಬಣ್ಣ ನಮೂದಿಸಿ
mr: वाहनाचा रंग प्रविष्ट करा
ru: Введите цвет транспорта
zh: 请输入车辆颜色

# vehiclePlateWarning
source: Enter vehicle plate
kn: ವಾಹನ ನಂಬರ್ ಪ್ಲೇಟ್ ನಮೂದಿಸಿ
mr: वाहन क्रमांक प्रविष्ट करा
ru: Введите номерной знак
zh: 请输入车牌号

# vehicleCapacityWarning
source: Enter vehicle capacity
kn: ವಾಹನ ಸಾಮರ್ಥ್ಯ ನಮೂದಿಸಿ
mr: वाहन क्षमता प्रविष्ट करा
ru: Введите вместимость транспорта
zh: 请输入车辆容量

# vehicleTypeWarning
source: Select vehicle type
kn: ವಾಹನ ಆಯ್ಕೆಮಾಡಿ
mr: वाहन प्रकार निवडा
ru: Выберите тип транспорта
zh: 请选择车辆类型

source: Sign in as User
kn: ಬಳಕೆದಾರನಾಗಿ ಲಾಗಿನ್ ಮಾಡಿ
mr: वापरकर्त्याप्रमाणे साइन इन करा
ru: Войти как пользователь
zh: 以用户身份登录

source: Sign in as Captain
kn: ಕ್ಯಾಪ್ಟನಾಗಿ ಲಾಗಿನ್ ಮಾಡಿ
mr: कॅप्टनप्रमाणे साइन इन करा
ru: Войти как водитель
zh: 以司机身份登录

# registerAsCaptain
source: Register as a Captain
kn: ಕ್ಯಾಪ್ಟನಾಗಿ ನೋಂದಾಯಿಸಿ
mr: कॅप्टन म्हणून नोंदणी करा
ru: Зарегистрироваться как водитель
zh: 注册为司机

# alreadyHaveAccount
source: Already have an account?
kn: ಈಗಾಗಲೇ ಖಾತೆಯಿದೆಯೇ?
mr: आधीच खाते आहे का?
ru: Уже есть аккаунт?
zh: 已经有账户了？

source: Earned
kn: ಸಾಧನೆ
mr: कमावलेले
ru: Заработано
zh: 收入

source: New Ride Available
kn: ಹೊಸ ರೈಡ್ ಲಭ್ಯವಿದೆ
mr: नवीन राईड उपलब्ध आहे
ru: Новая поездка доступна
zh: 有新的行程可用

source: Confirm Ride to Start!
kn: ರೈಡ್ ಪ್ರಾರಂಭಿಸಲು ದೃಢೀಕರಿಸಿ!
mr: राईड सुरू करण्यासाठी पुष्टी करा!
ru: Подтвердите поездку для начала!
zh: 确认行程以开始！

source: Ride in Progress
kn: ರೈಡ್ ನಡೆಯುತ್ತಿದೆ
mr: राईड सुरू आहे
ru: Поездка в процессе
zh: 行程进行中

source: Waiting for Payment
kn: ಪಾವತಿ ನಿರೀಕ್ಷೆ
mr: पेमेंटची प्रतीक्षा
ru: Ожидание оплаты
zh: 等待付款

source: Ride Completed
kn: ರೈಡ್ ಪೂರ್ಣಗೊಂಡಿದೆ
mr: राईड पूर्ण झाली
ru: Поездка завершена
zh: 行程已完成

source: Enter OTP
kn: OTP ನಮೂದಿಸಿ
mr: OTP प्रविष्ट करा
ru: Введите OTP
zh: 输入验证码

source: Please enter OTP
kn: ದಯವಿಟ್ಟು OTP ನಮೂದಿಸಿ
mr: कृपया OTP प्रविष्ट करा
ru: Пожалуйста, введите OTP
zh: 请输入验证码

source: Waiting for Payment Confirmation
kn: ಪಾವತಿ ದೃಢೀಕರಣಕ್ಕಾಗಿ ನಿರೀಕ್ಷೆ
mr: पेमेंट पुष्टीची प्रतीक्षा आहे
ru: Ожидание подтверждения оплаты
zh: 等待付款确认

source: Find a trip
kn: ರೈಡ್ ಹುಡುಕಿ
mr: एक ट्रिप शोधा
ru: Найти поездку
zh: 查找行程

source: Pickup Location
kn: ಪಿಕಪ್ ಸ್ಥಳ
mr: पिकअप स्थान
ru: Место отправления
zh: 上车地点

source: Destination
kn: ಗಮ್ಯಸ್ಥಾನ
mr: गंतव्यस्थान
ru: Место назначения
zh: 目的地

source: Search Vehicles
kn: ವಾಹನಗಳನ್ನು ಹುಡುಕಿ
mr: वाहने शोधा
ru: Поиск транспорта
zh: 搜索车辆

source: You are here
kn: ನೀವು ಇಲ್ಲಿ ಇದ್ದೀರಿ
mr: तुम्ही येथे आहात
ru: Вы здесь
zh: 您在这里

source: Choose a vehicle
kn: ವಾಹನವನ್ನು ಆಯ್ಕೆಮಾಡಿ
mr: वाहन निवडा
ru: Выберите транспорт
zh: 选择一辆车

source: Affordable, compact rides
kn: ಅರ್ಜೆಂಟ್ ಮತ್ತು ಚಿಕ್ಕ ರೈಡ್ಸ್
mr: परवडणाऱ्या आणि कॉम्पॅक्ट राईड्स
ru: Доступные и компактные поездки
zh: 实惠紧凑的出行方式

source: Book A
kn: ಬುಕ್ ಮಾಡಿ
mr: बुक करा
ru: Забронировать
zh: 预订

source: No fare fetched
kn: ಕಿರಾಯಿಯ ಮಾಹಿತಿ ಲಭ್ಯವಿಲ್ಲ
mr: भाड्याची माहिती मिळाली नाही
ru: Стоимость не получена
zh: 未获取到费用

source: Looking for nearby drivers
kn: ಹತ್ತಿರದ ಚಾಲಕರಿಗಾಗಿ ಹುಡುಕುತ್ತಿದೆ
mr: जवळच्या ड्रायव्हर्ससाठी शोध घेत आहे
ru: Поиск ближайших водителей
zh: 正在寻找附近司机

source: Cancel Ride
kn: ರೈಡ್ ರದ್ದುಮಾಡಿ
mr: राईड रद्द करा
ru: Отменить поездку
zh: 取消行程

source: Accept
kn: ಸ್ವೀಕರಿಸಿ
mr: स्वीकारा
ru: Принять
zh: 接受

source: Confirm
kn: ದೃಢೀಕರಿಸಿ
mr: पुष्टी करा
ru: Подтвердить
zh: 确认

source: Completed Ride
kn: ಪ್ರಯಾಣ ಮುಗಿದಿದೆ
mr: प्रवास पूर्ण झाला
ru: Поездка завершена
zh: 行程已完成

source: Payment Pending
kn: ಪಾವತಿ ಬಾಕಿ ಇದೆ
mr: देयक प्रलंबित आहे
ru: Ожидается оплата
zh: 付款待处理

source: Payment Done
kn: ಪಾವತಿ ಮುಗಿದಿದೆ
mr: देयक पूर्ण झाले
ru: Оплата завершена
zh: 付款已完成

source: Waiting for Confirmation
kn: ದೃಢೀಕರಣಕ್ಕಾಗಿ ಕಾಯಲಾಗುತ್ತಿದೆ
mr: पुष्टीकरणाची प्रतीक्षा
ru: Ожидание подтверждения
zh: 等待确认

source: Ride Started
kn: ಪ್ರಯಾಣ ಆರಂಭಿಸಲಾಗಿದೆ
mr: प्रवास सुरू झाला आहे
ru: Поездка началась
zh: 行程已开始

source: Make Payment
kn: ಪಾವತಿ ಮಾಡಿ
mr: भरणा करा
ru: Совершить оплату
zh: 付款
